---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidType.ClearAllTemperatures
source: html/b530979d-4f94-bd52-0c02-83b740cf6947.htm
---
# Autodesk.Revit.DB.Plumbing.FluidType.ClearAllTemperatures Method

Clears all fluid temperatures in the set.

## Syntax (C#)
```csharp
public void ClearAllTemperatures()
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown if some temperatures in the FluidType object are in use.